import recipe1 from "../../assets/recipes/recipe1.jpg";
import recipe2 from "../../assets/recipes/recipe2.jpg";
import recipe3 from "../../assets/recipes/recipe3.jpg";
import recipe4 from "../../assets/recipes/recipe4.jpg";
import recipe5 from "../../assets/recipes/recipe5.jpg";
import recipe6 from "../../assets/recipes/recipe6.jpg";

const recipes = {
    title: 'Способы использования',
    buttonText: 'Предложенный Рецепт',
    cards: [
        {
            title: 'Утренний Порционный Заряд для Каши',
            caption: 'Добавьте каплю своим утренним овсянкам или каше для богатого белком начала дня, улучшая их питательную ценность и вкус.',
            image: recipe1,
            content: {
                title: 'Рецепт овсяной каши с смузи Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1 стакан овсянки (предпочтительно цельнозерновая)",
                        "2 стакана воды или растительного молока",
                        "½ стакана смузи Fiteg2 (Манго, Апельсин, Яблоко и Ваниль - выберите свой любимый!)",
                        "Свежие фрукты на ваш выбор (например, бананы, ягоды или манго)",
                        "1 столовая ложка тертых орехов или семечек (например, миндаль, грецкие орехи или льняные семечки)",
                        "Натуральный подсластитель на ваш выбор (например, мед или агавовый сироп)",
                    ],
                    'Приготовление': [
                        "Приготовление овсянки: положите овсянку и воду/растительное молоко в кастрюлю на средний огонь. Перемешивайте и варите до тех пор, пока овсянка не станет мягкой и каша не приобретет необходимую консистенцию.",
                        "Добавление смузи: снимите кастрюлю с плиты и аккуратно вмешайте смузи Fiteg2 в кашу. Это не только добавит белок, но и придаст прекрасный фруктовый вкус и цвет.",
                        "Посыпка: добавьте свежие фрукты или тертые орехи или семечки сверху. Это обеспечит текстуру и питательную ценность.",
                        "Финал: при желании добавьте натуральный подсластитель, чтобы усилить сладость. Перемешайте."
                    ],
                    'Замечания': [
                        "Экспериментируйте с различными вкусами смузи Fiteg2, чтобы каждое утро попробовать что-то новое.",
                        "Этот рецепт - отличный способ добавить белок и клетчатку к вашему утреннему завтраку.",
                        "Чтобы получить более кремовую текстуру, используйте больше овсянки и меньше жидкости."
                    ],
                },
            },
        },
        {
            title: 'Ингредиент для Смузи',
            caption: 'Добавьте его в фруктовые или овощные смузи для дополнительного белкового удара, сделав смузи более сытными и питательными.',
            image: recipe2,
            content: {
                title: 'Рецепт Обогащенного Смузи Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1 стакан муки (можно также использовать цельнозерновую или безглютеновую муку)",
                        "2 чайные ложки разрыхлителя",
                        "Щепотка соли",
                        "1 стакан смузи Fiteg2 (Манго, Апельсин или Яблоко и Ваниль)",
                        "¼ стакана растительного молока или воды (по необходимости)",
                        "1 столовая ложка растительного масла или расплавленного кокосового масла",
                        "По желанию: натуральные подсластители (мед, агавовый сироп), ягоды или кусочки фруктов"
                    ],
                    'Приготовление': [
                        "Смешивание сухих ингредиентов: смешайте муку, разрыхлитель и соль в миске.",
                        "Добавление смузи: добавьте смузи Fiteg2 к сухим ингредиентам. Это обеспечит дополнительный белок и аромат.",
                        "Добавление жидкости: добавьте растительное молоко или воду по мере необходимости для достижения желаемой консистенции.",
                        "Добавление масла: добавьте растительное масло или кокосовое масло.",
                        "Приготовление: используйте немного масла или кулинарного спрея на среднем огне, готовьте блины с обеих сторон до золотистого цвета."
                    ],
                    'Замечания': [
                        "Этот рецепт отлично подходит для творческих экспериментов: изменяйте типы муки, добавляйте различные специи или смеси фруктов.",
                        "Смузи Fiteg2 добавляют не только белок, но и уникальный вкус вашим блинам.",
                        "Блины можно подавать с натуральными подсластителями, свежими ягодами или фруктовым соусом, чтобы сделать их еще вкуснее."
                    ],
                },
            },
        },
        {
            title: 'Замена для Выпечки',
            caption: 'Используйте его как здоровую, белковую замену в рецептах для выпечки, таких как блины, маффины или протеиновые батончики.',
            image: recipe3,
            content: {
                title: 'Рецепт Блинов Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1 стакан муки (можно также использовать цельнозерновую или безглютеновую муку)",
                        "2 чайные ложки разрыхлителя",
                        "Щепотка соли",
                        "1 стакан смузи Fiteg2 (Манго, Апельсин или Яблоко и Ваниль)",
                        "¼ стакана растительного молока или воды (по необходимости)",
                        "1 столовая ложка растительного масла или расплавленного кокосового масла",
                        "По желанию: натуральные подсластители (мед, агавовый сироп), ягоды или кусочки фруктов"
                    ],
                    'Приготовление': [
                        "Смешивание сухих ингредиентов: смешайте муку, разрыхлитель и соль в миске.",
                        "Добавление смузи: добавьте смузи Fiteg2 к сухим ингредиентам. Это обеспечит дополнительный белок и аромат.",
                        "Добавление жидкости: добавьте растительное молоко или воду по мере необходимости для достижения желаемой консистенции.",
                        "Добавление масла: добавьте растительное масло или кокосовое масло.",
                        "Приготовление: используйте немного масла или кулинарного спрея на среднем огне, готовьте блины с обеих сторон до золотистого цвета."
                    ],
                    'Замечания': [
                        "Этот рецепт отлично подходит для творческих экспериментов: изменяйте типы муки, добавляйте различные специи или смеси фруктов.",
                        "Смузи Fiteg2 добавляют не только белок, но и уникальный вкус вашим блинам.",
                        "Блины можно подавать с натуральными подсластителями, свежими ягодами или фруктовым соусом, чтобы сделать их еще вкуснее."
                    ],
                },
            },
        },
        {
            title: 'Заряди свое тело после тренировки',
            caption: 'Употребляйте его как напиток после тренировки для освежения и восстановления мышц.',
            image: recipe4,
            content: {
                title: 'Напиток для восстановления после тренировки Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1 стакан смузи Fiteg2 (Манго, Апельсин или Яблоко и Ваниль)",
                        "½ стакана неочищенной овсянки или белкового порошка (на ваш выбор)",
                        "½ стакана свежих или замороженных фруктов (например, бананы или ягоды)",
                        "¼ стакана йогурта или авокадо (для дополнительного жира и текстуры)",
                        "1 столовая ложка семян (например, льняные или чиа)",
                        "По желанию: натуральные подсластители или специи (например, корица, ваниль)"
                    ],
                    'Приготовление': [
                        "Приготовление ингредиентов: положите все ингредиенты в блендер.",
                        "Измельчение: измельчите до гладкости. При необходимости добавьте немного воды или растительного молока, чтобы достичь желаемой консистенции.",
                        "Дополнительная питательная ценность: при желании можно добавить овсянку или белковый порошок, чтобы улучшить питательную ценность и белок.",
                        "Завершение: при необходимости можно добавить натуральные подсластители или специи, чтобы улучшить вкус."
                    ],
                    'Замечания': [
                        "Этот напиток - отличный способ получить белок и клетчатку, которые важны для восстановления мышц.",
                        "Смузи Fiteg2 можно сочетать с разными фруктами, чтобы каждый раз получать новый вкус.",
                        "Авокадо и йогурт добавят кремовую текстуру и дополнительное питание."
                    ],
                },
            },
        },
        {
            title: 'Десертный Топпинг',
            caption: 'Полейте им десерты, такие как фруктовые салаты, пудинги или йогурт, чтобы придать им дополнительный вкус и белковый удар.',
            image: recipe5,
            content: {
                title: 'Рецепт Десертного Топпинга Смузи Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1 стакан смузи Fiteg2 (Манго, Апельсин или Яблоко и Ваниль)",
                        "Ваш любимый десерт, например, фруктовый салат, пудинг или йогурт",
                        "По желанию: свежие фрукты, орехи, семена или обжаренные стружки кокоса для топпинга"
                    ],
                    'Приготовление': [
                        "Приготовление десерта: приготовьте десерт на ваш выбор, например, фруктовый салат, пудинг или йогурт.",
                        "Добавление смузи: полейте смузи Fiteg2 сверху десерта. Это не только добавит белка, но и обеспечит уникальный и насыщенный вкус.",
                        "Украшение: добавьте свежие фрукты, орехи, семена или обжаренные стружки кокоса для придания дополнительной текстуры и питательной ценности десерту.",
                        "Подача: подавайте десерт сразу, чтобы насладиться свежими вкусами и текстурами."
                    ],
                    'Замечания': [
                        "Этот топпинг - отличный способ добавить здоровые белки в десерты, не потеряв при этом оригинального вкуса.",
                        "Вы можете экспериментировать с разными вкусами смузи Fiteg2, чтобы каждый раз получать новые оттенки.",
                        "Смузи Fiteg2 можно использовать также как соус, заправку, чтобы добавить дополнительную влажность и вкус десерту."
                    ],
                },
            },
        },
        {
            title: 'Улучшитель Каши',
            caption: 'Добавьте его в вашу завтракающую кашу, чтобы увеличить содержание белка и сделать более сбалансированным и насыщенным прием пищи.',
            image: recipe6,
            content: {
                title: 'Рецепт Завтракающей Каши со Смузи Fiteg2',
                lists: {
                    'Ингридиенты': [
                        "1-2 стакана вашей любимой завтракающей каши",
                        "½-1 стакан смузи Fiteg2 (Манго, Апельсин или Яблоко и Ваниль)",
                        "По желанию: свежие фрукты, орехи, семена или мед для топпинга"
                    ],
                    'Приготовление': [
                        "Приготовление завтракающей каши: положите завтракающую кашу в миску.",
                        "Добавление смузи: полейте смузи Fiteg2 поверх завтракающей каши. Это добавит важные белки к приему пищи и обеспечит прекрасный вкус.",
                        "Добавление топпинга: добавьте свежие фрукты, орехи или семена, чтобы улучшить питательную ценность и обеспечить разные текстуры.",
                        "Подача: подавайте сразу, чтобы насладиться свежими вкусами и питанием."
                    ],
                    'Замечания': [
                        "Попробуйте разные вкусы смузи Fiteg2, чтобы каждое утро начинать с балансированного приема пищи.",
                        "Добавьте свежие фрукты или натуральные подсластители, чтобы ваш завтрак был еще более вкусным и захватывающим.",
                        "Это отличный способ начать день с балансированным приемом пищи, богатым белком."
                    ],
                },
            },
        },
    ]
};

export default recipes;